[
  {
    "strTrack": "I Kissed a Girl",
    "strAlbum": "One of the Boys",
    "strArtist": "Katy Perry",
    "strGenre": "Pop",
    "strDescription": "\"I Kissed A Girl\" is a song performed by American recording artist Katy Perry for her debut album One of the Boys (2008). It was released as the album's first single on April 28, 2008 through Capitol Records. It was written by Perry, Lukasz Gottwald, Max Martin and Cathy Dennis, with production helmed by Gottwald under his production name Dr. Luke. Perry says the song is \"about the magical beauty of a woman\". The song is a electro-rock number that runs through a throbbing beat and contains influences of New Wave.\r\n\r\n\"I Kissed a Girl\" received mixed reception for music critics upon reviewing the parent album, praising its sound and structure while highly criticizing its lyrical content. The song drew controversy for its irreverent lyrics and was notably criticized by numerous critics and singers. The song experienced commercial success domestically as well as internationally. It topped the Billboard Hot 100 chart for seven consecutive weeks, becoming the 1000th chart-topper of the Rock Era. The single has sold over 4,155,000 digital copies in the US alone. \"I Kissed a Girl\" is one of six Perry songs to top 4 million paid downloads in the US, the others being \"Hot n Cold\", \"California Gurls\", \"Firework\", \"E.T.\" and \"Teenage Dream\". It has reached the summit of the charts in nearly twenty countries, including Australia, Canada, Ireland and the United Kingdom while peaking within the top five in other European countries like Belgium, Finland and France. The song was one of the best selling singles worldwide, selling 8 million copies, became the 21st song with the most paid downloads in history.\r\n\r\nThe accompanying music video for the song was released on May 16, 2008. The video, directed by Kinga Burza, features Perry in a setting inspired by burlesque and Moulin Rouge styles. It features an appearance from then-unknown American electropop singer Kesha. The song is recognized as the 10th best selling single in the 21st century. \"I Kissed a Girl\" was performed and a nominee at the 51st Grammy Awards (Grammy Award for Best Female Pop Vocal Performance). It was also nominated for Favorite Song at the 2009 Kids' Choice Awards.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/i_kissed_a_girl_katy_perry.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=tAp9BKosZXs"
  },
  {
    "strTrack": "The Pretender",
    "strAlbum": "Echoes, Silence, Patience & Grace",
    "strArtist": "Foo Fighters",
    "strGenre": "Alternative Rock",
    "strDescription": "\"The Pretender\" is a song by the American alternative rock band Foo Fighters. It was the first single from the group's 2007 album Echoes, Silence, Patience & Grace. It is one of Foo Fighters' most successful songs; only \"Learn to Fly\" and \"Best of You\" beat its position on the U.S. Billboard Hot 100.\r\n\r\nIn a 2007 interview with XFM, frontman Dave Grohl stopped short of explaining the meaning behind \"The Pretender\", but alluded its roots go to current political unrest. Grohl noted,\r\n\"That's the thing with lyrics, you never want to give away specifics, because it's nice for people to have their own idea or interpretation of the song. But, you know, everyone's been fucked over before and I think a lot of people feel fucked over right now and they're not getting what they were promised, and so something to do with that.\"\r\n\r\nGrohl also told XFM \"The Pretender\" was not initially planned for the album and happened really quickly.\r\n\"That song didn't happen until later on in the session. We didn't go into making the record with that song and it happened after we recorded a lot of stuff. Up until that point, I didn't know if we had a good opening song or not. So after we recorded it, I thought, 'oh this is perfect, we have the song to open the record,' and it just became everybody's favorite song. ... It's the type of song that I look forward to opening shows with and it came together really easily. We put that song together in, I don't know, a day, whereas a lot of the other songs we worked on for weeks.\"",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/the_pretender_foo_fighters.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=SBjQ9tuuTJQ"
  },
  {
    "strTrack": "Lady",
    "strAlbum": "Kenny Rogers' Greatest Hits",
    "strArtist": "Kenny Rogers",
    "strGenre": "Country",
    "strDescription": "\"Lady\" is a song written by Lionel Richie and first recorded by American country music artist Kenny Rogers. It was released in September 1980 on the album Kenny Rogers' Greatest Hits.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/kenny_rogers_lady.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=ZYRfUoR9Q4Y"
  },
  {
    "strTrack": "Roygbiv",
    "strAlbum": "Music Has the Right to Children",
    "strArtist": "Boards of Canada",
    "strGenre": "Ambient",
    "strDescription": "While many of the tracks on Music Has the Right to Children could be described as dark or unsettling, “Roygbiv” among others is rather peaceful and melodic. Marcus Eoin told XLR8R in 2001: \"Someone criticized me once, and asked why we'd made \"Roygbiv\" so short. For us, that is exactly how long it should be. It's like that famous bit at the end of \"Strawberry Fields\" by The Beatles, where you get the little voice at the end that says something like \"I buried Paul\", and it happens once, and it's such a transitory thing that's mixed in one ear really far away, but people went on and on about it for decades.\" The title is a reference to a mnemonic for remembering the colours of the rainbow: Red, Orange, Yellow, Blue, Indigo, and Violet.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/boards_of_canada_roygbiv.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=yT0gRc2c2wQ"
  },
  {
    "strTrack": "Space Oddity",
    "strAlbum": "Space Oddity",
    "strArtist": "David Bowie",
    "strGenre": "Rock",
    "strDescription": "\"Space Oddity\" is a song written and recorded by David Bowie. It was first released as a 7-inch single on 11 July 1969. It was also the opening track of his second studio album, David Bowie. It became one of Bowie's signature songs and one of four of his songs to be included in The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll.\r\n\r\nInspired by Stanley Kubrick's film 2001: A Space Odyssey (1968), the song is about the launch of Major Tom, a fictional astronaut, and was released during a period of great interest in space flight. The United States' Apollo 11 mission would launch five days later and would become the first manned moon landing another five days after that. The lyrics have also been seen to lampoon the British space programme, which was and still is an unmanned project. Bowie would later revisit his Major Tom character in the songs \"Ashes to Ashes\", \"Hallo Spaceboy\" and possibly the music video for \"Blackstar\".\r\n\r\n\"Space Oddity\" was David Bowie's first single to chart in the UK. It reached the top five on its initial release and received the 1970 Ivor Novello Special Award for Originality. His second album, originally released as David Bowie in the UK, was renamed after the track for its 1972 re-release by RCA Records and became known by this name. In 1975, upon re-release as part of a maxi-single, the song became Bowie's first UK No. 1 single.\r\n\r\nIn December 1972, Mick Rock shot a video of Bowie miming to the June 1969 recording of the song, during the sessions for Aladdin Sane. The resulting music video was used to promote the 1973 US reissue of the \"Space Oddity\" single on RCA.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/david_bowie_space_oddity.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=iYYRH4apXDo"
  },
  {
    "strTrack": "Mr. Saxobeat",
    "strAlbum": "Saxobeats",
    "strArtist": "Alexandra Stan",
    "strGenre": "Pop",
    "strDescription": "\"Mr. Saxobeat\" is a song by Romanian recording artist Alexandra Stan from her debut studio album Saxobeats (2011). \"Mr. Saxobeat\" is an up-tempo Eurodance song with house elements. The song contains a love message, where Stan speaks of a man she is attracted to and the way she makes her move. It was written by Andrei Nemirschi and Marcel Prodan a Romanian producing-duo and produced by the latter one at the Maan Studios in Romania. It was firstly released under Maan Music Label and then internationally under Columbia Records.\r\n\r\nIt shortly became a global hit. At first it conquered Romania where it spent eight straight weeks at number-one. It has then expanded to Spain, France, Belgium and shortly after all through Europe (becoming a top five all over the countries, excluding France and Ireland and it was even a number-one hit in at least ten charts). It has then entered the top thirty of the Canadian Hot 100 and ultimately on the Billboard Hot 100. Moreover, it entered the top five in New Zealand and the top twenty in Australia.\r\n\r\nAn accompanying music video was shot in MediaPro Studios, Buftea in order to promote the song. It shows Stan being arrested, thrown in jail, and seducing a guard to escape. The song was also the first million-selling single in Romania. The song was featured on the sixth episode of the first season of the American sitcom Suburgatory titled \"Charity Case\", can also be heard in the background of the last episode of the final season of CSI: Miami, titled \"Habeas Corpse\". It is also available on the Kinect Xbox 360 game, Dance Central 3 and Just Dance 4.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/alexandra_stan_mr_saxobeat.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=lAhHNCfA7NI"
  },
  {
    "strTrack": "Crying in the Club",
    "strAlbum": "Crying in the Club",
    "strArtist": "Camila Cabello",
    "strGenre": "Pop",
    "strDescription": "\"Crying in the Club\" is the debut solo single by Cuban-American singer Camila Cabello, released on May 19, 2017. It was written by Cabello, Sia, Benny Blanco and produced by Blanco, Happy Perez and Cashmere Cat. The song samples Christina Aguilera's \"Genie in a Bottle\". A mid-tempo tropical pop and dance track, it was originally intended to be the lead single of Cabello's debut studio album, which was originally titled The Hurting. The Healing. The Loving. It was later removed from the track listing and featured on the Side A of the 7-inch eponymous extended play released on July 14, 2017. The song reached number three in Bulgaria, as well as the top forty in eleven additional countries. \"Crying in the Club\" is certified Platinum in the US, UK, Canada, Australia, and Italy. It is the first single since her departure from American girl group Fifth Harmony.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/camila_cabello_crying_in_the_club.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=NlrYn_dZdqk"
  },
  {
    "strTrack": "Thinking Out Loud",
    "strAlbum": "x",
    "strArtist": "Ed Sheeran",
    "strGenre": "Pop",
    "strDescription": "\"Thinking Out Loud\" is a song by English singer-songwriter Ed Sheeran. It features production from frequent collaborator Jake Gosling. The song was released as an \"instant grat\" digital download to the iTunes Store on 18 June 2014, serving as a promotional single from his second studio album, x (2014). It entered the UK Singles Chart at number 26 and has since peaked at number 13. \"Thinking Out Loud\" impacted Australian radio on 14 August 2014, and is scheduled for release as the third single off x.\r\n\r\nSheeran has described the piece as a \"walking down the aisle song\" . The song is a romantic ballad. It has been confirmed as the album's third single, with the music video premiered on 7 October 2014.\r\n\r\nOn the 8th of October, 2014, a music video was released for the song. It features Sheeran and his ballroom partner Brittany Cherry dancing, with choreography by Nappytabs and training help from Paul Karmiryan. After only sixteen hours, the video hit 2,000,000 views on YouTube.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/ed_sheeran_thinking_out_loud.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=lp-EO5I60KA"
  },
  {
    "strTrack": "Yes Sir, I Can Boogie",
    "strAlbum": "The Best Of",
    "strArtist": "Baccara",
    "strGenre": "Disco",
    "strDescription": "\"Yes Sir, I Can Boogie\" is a 1977 hit single by the Spanish vocal duo Baccara. Written by Frank Dostal and Rolf Soja, and produced by Soja, this disco song was a hit across Europe and became the duo's sole number one single in the UK, spending a single week at the top in October 1977. It did not chart in the United States, despite receiving airplay in several markets. The only official sources of record sales are the German and British music certification databases showing sales of 250,000 and 500,000 sales respectively.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/baccara_yes_sir_i_can_boogie.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=32wDFCM7iSI"
  },
  {
    "strTrack": "Demons",
    "strAlbum": "Night Visions",
    "strArtist": "Imagine Dragons",
    "strGenre": "Indie",
    "strDescription": "\"Demons\" is a song written and recorded by American indie rock band Imagine Dragons, for their major label debut EP Continued Silence. The song appears as the second track on the EP. the song was also included on their debut studio album, Night Visions as the fourth track. \"Demons\" was solicited to United States Triple A radio on January 28, 2013. It has been confirmed that the song will also be released as the fourth single from Night Visions in 2013. The song has so far reached No. 89 on the Billboard Hot 100 chart.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/imagine_dragons_demons.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=orhJ1TzREZU"
  },
  {
    "strTrack": "Schism",
    "strAlbum": "Lateralus",
    "strArtist": "Tool",
    "strGenre": "Progressive Metal",
    "strDescription": "\"Schism\" is a song by American rock band Tool. It was the first single and music video from their third full-length album, Lateralus. In 2002, Tool won the Grammy Award for Best Metal Performance for the song.\r\n\"Schism\" was released as a DVD single on December 20, 2005. The DVD contains the music video, dual-commentary by David Yow, and a remix by Lustmord.\r\n\r\n\"Schism\" is renowned for its use of uncommon time signatures and the frequency of its meter changes. In one analysis of the song, the song alters meter 47 times. The song begins with two bars of 5/4, followed by one bar of 4/4, followed by bars of alternating 5/8 and 7/8, until the first interlude, which consists of alternating bars of 6/8 and 7/8.\r\nThe following verse exhibits a similar pattern to the first, alternating bars of 5/8 and 7/8. The next section is bars of 6/4 followed by one bar of 11/8. This takes the song back into alternating 5/8 and 7/8. Another 6/8 and 7/8 section follows, and after this the song goes into repeating 7/8 bars.\r\nThe middle section is subsequently introduced, consisting of three bars of 6/8, one bar of 3/8, and one bar of 3/4 repeating several times. At one point it interrupts with two bars of 6/8 followed by a bar of 4/8, twice. A bar of 5/8 is played before the meter switches back to 6/8 for two bars and 2/4 for one bar. This repeats, setting up another section: two bars of 9/8 followed by a bar of 10/8, that pattern again, and then a single bar of 9/8 followed by alternating bars of 6/8 and 7/8. The outro has alternating bars of 5/8 and 7/8, ending with alternating 6/8, 2/8 that one could interpret as pulsing with a 4/4 feel.\r\nThe band has referred to the time signature as 6.5/8. Although many composers would use 13/16 instead, 6.5/8 is still a valid fractional time signature.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/tool_schism.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=yMMz2VwbhVI"
  },
  {
    "strTrack": "Chasing Pavements",
    "strAlbum": "19",
    "strArtist": "Adele",
    "strGenre": "Soul",
    "strDescription": "\"Chasing Pavements\" is the second single from soul singer Adele. Adele performed the song on Friday Night with Jonathan Ross on 7 December 2007. It was released digitally in Ireland on 13 January 2008 and entered the Irish singles chart at number 26 through download sales alone. Having received a physical release, the single then leaped 19 places to number seven, where it peaked. On 20 January, the single entered at number two in the UK singles chart on downloads alone. \"Chasing Pavements\" was the 27th best selling single of 2008 in the UK, with over 280,000 sales. The song was performed by Melissa Benoist on the episode The New Rachel of Glee.\r\n\r\nIt was featured in three episodes of Hollyoaks. The first was in a concluding scene of Hannah Ashworth's anorexia. The second was in a beginning scene of Charlie Dean's custody battle. The third was in a scene showing Dominic Reilly reflecting on Tina McQueen talking to him, which was aired on 15 October. The song was also featured in Wild Child, starring Emma Roberts and the late Natasha Richardson and TV shows such as 90210 and Glee. Adele performed \"Chasing Pavements\" along with \"Cold Shoulder\" on Saturday Night Live on 18 October 2008. The B-side to the single, \"That's It, I Quit, I'm Movin' On\", is an acoustic cover of a Sam Cooke song. It's Adele's first top 40 hit on the Billboard Hot 100 and has sold over 1,200,000 digital copies as of October 2011.\r\n\r\n\"Chasing Pavements\" won the Grammy Award for Best Female Pop Vocal Performance, and was nominated for the Grammy Award for Record of the Year and Grammy Award for Song of the Year.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/adele_chasing_pavements.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=08DjMT-qR9g"
  },
  {
    "strTrack": "Smells Like Teen Spirit",
    "strAlbum": "Nevermind",
    "strArtist": "Nirvana",
    "strGenre": "Grunge",
    "strDescription": "\"Smells Like Teen Spirit\" is a song by the American rock band Nirvana. It is the opening track and lead single from the band's second album, Nevermind (1991), released on DGC Records. Written by Kurt Cobain, Krist Novoselic, and Dave Grohl and produced by Butch Vig, the song uses a verse-chorus form where the main four-chord riff is used during the intro and chorus to create an alternating loud and quiet dynamic.\r\nThe unexpected success of \"Smells Like Teen Spirit\" in late 1991 propelled Nevermind to the top of the charts at the start of 1992, an event often marked as the point where alternative rock entered the mainstream. \"Smells Like Teen Spirit\" was Nirvana's biggest hit, reaching number six on the Billboard Hot 100 and placing high on music industry charts all around the world in 1991 and 1992.\r\n\"Smells Like Teen Spirit\" received many critical plaudits, including topping the Village Voice Pazz & Jop critics' poll and winning two MTV Video Music Awards for its music video, which was in heavy rotation on music television. The song was dubbed an \"anthem for apathetic kids\" of Generation X, but the band grew uncomfortable with the success and attention it received as a result. In the years since Cobain's death, listeners and critics have continued to praise \"Smells Like Teen Spirit\" as one of the greatest rock songs of all time.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/nirvana_smells_like_teen_spirit.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=hTWKbfoikeg"
  },
  {
    "strTrack": "Insomnia",
    "strAlbum": "Reverence",
    "strArtist": "Faithless",
    "strGenre": "Electronic",
    "strDescription": "\"Insomnia\" is the title of a song recorded by British dance group Faithless. Released as the band's second single, it became one of their most successful. It was released in 1995 and became a hit in Dance Charts while peaking at #27 in the UK in 1995 and #1 in 1996 . The song also reached #48 in the UK chart as a re-entry in 2005, showing the song's longevity. The album version is nearly nine minutes long and contains some lyrics not able to be broadcast on the radio edit due to their explicit content. It also contains some bells chiming at the start of the song not generally known by the club-going public as many people know the Monster Mix or the Monster Mix Radio Edit. The Monster Mix was the mix featured on Faithless' greatest hits album Forever Faithless. The song topped the U.S. Hot Dance Club Play chart. The Moody Mix featured on some of the singles was also on the Reverence / Irreverence release.\r\n\r\nFaithless have expressed their displeasure with the fact that elements of this song were reused by Sash! for his single \"Encore Une Fois\". Norwegian electronica artist Biosphere has claimed that Faithless sampled the bassline from his single \"Novelty Waves\".\r\n\r\nThe song is widely considered to be one of the best dance floor anthems of all time, and sparked off a new genre of music.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/faithless_insomnia.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=P8JEm4d6Wu4"
  },
  {
    "strTrack": "Karma Police",
    "strAlbum": "OK Computer",
    "strArtist": "Radiohead",
    "strGenre": "Alternative Rock",
    "strDescription": "\"Karma Police\" is a song by English alternative rock band Radiohead from their 1997 third studio album OK Computer. The song's title and lyrics derive from an in-joke among the band, referring to the Hindu theory of cause and effect, known as karma.\r\n\r\n\"Karma Police\" was released as the second single from OK Computer, and became a commercial success, charting at number eight on the UK Singles Chart and number fourteen on the US Hot Modern Rock Tracks. Critical reception to the single was also favourable.\r\n\r\nIn 2008 the song was featured on the Radiohead: The Best Of collection.\r\n\r\n\"Karma Police\", like several other songs that would make up OK Computer, was debuted live in 1996, when the band briefly supported Alanis Morissette on tour. A live version of \"Karma Police\", performed with a Rhodes piano on the Late Show with David Letterman, is captured in the Radiohead documentary Meeting People Is Easy.\r\n\r\n\"Karma Police\" is in a 4/4 time signature and played in standard tuning. The first half of the song is in the key of E minor, and would feature a Neapolitan chord (F). The second half (starting with the line \"For a minute there\") is in B minor. Acoustic guitar and piano are the most prominent instruments in the song, and the chord progression owes an audible debt to The Beatles song \"Sexy Sadie\".\r\n\r\nThe structure of the song is unconventional in that it has nothing resembling a typical chorus. Instead, the song progresses from the intro into a mid-tempo section which alternates between two verses. The first verse begins with the line \"Karma police\", and the other begins with the line \"This is what you'll get\". During the second section the drums drop out and an analog synthesizer imitating a choir is featured. After this section cycles through twice, the song switches into a second section which is based around the line \"For a minute there, I lost myself\". During this section of the song, Yorke's voice is put through an echo effect and a sliding melodic figure serves as a counterpoint to Yorke's vocals. In the outro, Ed O'Brien plays a few notes on his guitar, which are distorted by overloading an AMS rackmount digital delay unit and turning the delay rate knob down.\r\n\r\nRadiohead members used to tell one another that they would call \"the karma police\" on them if they did something bad. The joke was incorporated into the lyrics and title of the song. Yorke explained that the song was about stress and \"having people looking at you in that certain  way, I can't handle it anymore\". Thom Yorke explained the idea of the lyrics to The Independent in 2006, saying, \"It's for someone who has to work for a large company. This is a song against bosses. Fuck the middle management!\" Yorke and Jonny Greenwood emphasised in interviews that the song had a humorous bent; Yorke said, \" not entirely serious, I hope people will realize that.\" The song includes the line \"He buzzes like a fridge/He's like a detuned radio\", a reference to the distracting, metaphorical background noise Yorke calls \"fridge buzz\". Yorke has said that the idea of fridge buzz is one of the primary themes of OK Computer. \"Karma Police\" also shares themes of insanity and dissatisfaction with capitalism.\r\n\r\nThe music video for the song was directed by Jonathan Glazer, previously responsible for Radiohead's \"Street Spirit (Fade Out)\" clip. The video premiered in August 1997 and featured Radiohead frontman Thom Yorke as well as Hungarian actor Lajos Kovács. Glazer won MTV's Director of the Year award in 1997 for his work on this, as well as Jamiroquai's \"Virtual Insanity\". Glazer however revealed in an interview that he considers this video to be a failed attempt. According to MTV.com, Glazer had pitched the concept of the \"Karma Police\" video months earlier to Marilyn Manson, who disliked it.\r\n\r\nThe video starts with the camera, an unseen driver, looking at the empty back seat of a 1976 Chrysler New Yorker at night. The 'driver' then faces the windscreen and begins driving. For 35 seconds, it shows nothing but a road through grass illuminated by headlights, with insects visible around the windscreen. A figure is then seen running from the car. In time for the chorus the view shifts back to the back seat, where Thom Yorke now sits, almost mumbling his lyrics. The view yet again moves to the figure, who is close to being mown down, as the view again switches to Yorke, now slouching drowsily against the back of the front seat, barely lipsyncing any longer. The camera swivels again and the figure appears again, close this time. For the first time another perspective reveals the outside of the car. The pursued figure sharpens and is revealed to be a large man with a frightened look. The car comes to a stop before him, then reverses slightly, as if for a 'run up', and this reveals it to be leaking fuel. The man realises the car has a petrol leak and puts his hands behind his back as if in resignation, then takes matches from his pocket, lights one, and throws it down. The perspective shifts to the car's interior. The car suddenly reverses, away from the man, a path of fire now blazes back towards the car. The car slowly catches fire, and the camera/driver finally turns frantically to the back seat and robotically swivels back and forth, only to find that Yorke is no longer there.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/radiohead_karma_police.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=1uYWYWPc9HU"
  },
  {
    "strTrack": "Dreams",
    "strAlbum": "Rumours",
    "strArtist": "Fleetwood Mac",
    "strGenre": "Rock",
    "strDescription": "\"Dreams\" is a song by Fleetwood Mac from their eleventh studio album Rumours (1977). In the United States, \"Dreams\" was released as the second single from Rumours on March 24, 1977, while in the United Kingdom it was released as the third single in June 1977. A performance of \"Dreams\" on stage was used as the promotional music video.\r\n\r\nIn the US, \"Dreams\" reached the top spot on the Billboard Hot 100, the band's only number-one single there; it sold over a million copies. In Canada, \"Dreams\" also reached number one on the RPM Top 100 Singles chart.\r\n\r\nBackground and composition\r\nThe members of Fleetwood Mac were experiencing emotional upheavals while recording the Rumours album. Mick Fleetwood was going through a divorce. Christine McVie was separating from her husband John McVie. Lindsey Buckingham and Stevie Nicks were ending their eight-year relationship. \"We had to go through this elaborate exercise of denial,\" explained Buckingham to Blender magazine, \"keeping our personal feelings in one corner of the room while trying to be professional in the other.\"\r\n\r\nNicks wrote the song in early 1976 at the Record Plant studio in Sausalito, California. \"One day when I wasn't required in the main studio,\" remembers Nicks to Blender magazine, \"I took a Fender Rhodes piano and went into another studio that was said to belong to Sly Stone, of Sly and the Family Stone. It was a black-and-red room, with a sunken pit in the middle where there was a piano, and a big black-velvet bed with Victorian drapes.\"\r\n\r\n\"I sat down on the bed with my keyboard in front of me,\" continues Nicks. \"I found a drum pattern, switched my little cassette player on and wrote 'Dreams' in about 10 minutes. Right away I liked the fact that I was doing something with a dance beat, because that made it a little unusual for me.\"\r\n\r\nWhen Nicks played the song to the rest of the group, \"They weren't nuts about it. But I said 'Please! Please record this song, at least try it'. Because the way I play things sometimes... you really have to listen.\" The band recorded it the following day. Only a basic track was recorded at Sausalito. Recording assistant Cris Morris remembers that \"all (they) kept was the drum track and live vocal from Stevie – the guitars and bass were added later in Los Angeles.\" Christine McVie described the song as having \"just three chords and one note in the left hand\" and \"boring\" when Nicks played a rough version on the piano. McVie changed her mind after Buckingham \"fashioned three sections out of identical chords, making each section sound completely different. He created the impression that there's a thread running through the whole thing.\"",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/fleetwood_mac_dreams.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=mrZRURcb1cM"
  },
  {
    "strTrack": "Billie Jean",
    "strAlbum": "Thriller",
    "strArtist": "Michael Jackson",
    "strGenre": "Pop",
    "strDescription": "\"Billie Jean\" is a song by American recording artist Michael Jackson. It is the second single from the singer's sixth solo album, Thriller (1982). It was written and composed by Jackson and produced by him and Quincy Jones. There are contradictory claims to what the song's lyrics refer to. One suggests that they are derived from a real-life experience, in which a female fan claimed that Jackson (or one of his brothers) had fathered one of her twins. However, Jackson himself stated that \"Billie Jean\" was based on groupies he had encountered. The song is well known for its distinctive bassline by guitarist David Williams, and Jackson's vocal hiccups. The song was mixed 91 times by audio engineer Bruce Swedien before it was finalized.\r\n\r\nThe song became a worldwide commercial and critical success; it was one of the best-selling singles of 1983 and is one of the best-selling singles worldwide. The song topped both the US and UK charts simultaneously. In other countries, it topped the charts of Switzerland and reached the top ten in Austria, Italy, New Zealand, Norway and Sweden. \"Billie Jean\" was certified platinum by the Recording Industry Association of America (RIAA) in 1989. Rolling Stone magazine placed the song in the 58th spot on its list of The 500 Greatest Songs of All Time.\r\n\r\nAwarded numerous honors—including two Grammy Awards, one American Music Award, and an induction into the Music Video Producers Hall of Fame—the song and corresponding music video propelled Thriller to the status of best-selling album of all time. The song was promoted with a short film that broke down MTV's racial barrier as the first video by a black artist to be aired in heavy rotation. Also, Jackson's Emmy-nominated performance on Motown 25: Yesterday, Today, Forever, in which Jackson premiered his \"moonwalk\" also helped to popularize the song. It was also promoted through Jackson's Pepsi commercials; during the filming of one commercial, Jackson's scalp was severely burned. Covered by modern artists, \"Billie Jean\" sealed Jackson's status as an international pop icon.\r\nJackson stated several times that \"Billie Jean\" was based on the groupies he and his brothers encountered while part of The Jackson 5. \"Billie Jean is kind of anonymous. It represents a lot of girls. They used to call them groupies in the '60s.\" He added: \"They would hang around backstage doors, and any band that would come to town they would have a relationship with, and I think I wrote this out of experience with my brothers when I was little. There were a lot of Billie Jeans out there. Every girl claimed that their son was related to one of my brothers.\"\r\n\r\nJackson biographer J. Randy Taraborrelli promoted the theory that \"Billie Jean\" was derived from a real life experience the singer faced in 1981. The Magic & The Madness documents how a young woman wrote Jackson a letter, which informed the singer that he was the father of one of her twins. Jackson, who regularly received letters of this kind, had never met the woman in question and ignored it. The woman, however, continued to send Jackson more letters, which stated that she loved him and wanted to be with him. She wrote of how happy they would be if they raised the child together. She pondered how Jackson could ignore his own flesh and blood. The letters disturbed the singer to the extent that he suffered nightmares.\r\n\r\nFollowing the letters, Jackson received a parcel containing a photograph of the fan, as well as a letter and a gun. Jackson was horrified; the letter asked that the pop singer kill himself on a certain day and at a specific time. The fan would do the same once she had killed their baby. She wrote that if they could not be together in this life, then they would be in the next. To his mother's dismay, Jackson had the photograph of the woman framed and hung above the dining room table of their family home. Afterwards, the Jacksons discovered that the fan had been sent to a psychiatric hospital.\r\nMichael Jackson wrote \"Billie Jean\" with his female fans in mind, and later stated that when he wrote the song, he knew it would be a success: \"A musician knows hit material. Everything has to feel in place. It fulfills you and it makes you feel good. That's how I felt about 'Billie Jean'. I knew it was going to be big when I was writing it.\" The singer explained that he was so absorbed by the song that, in one instance, he did not notice that his car had caught fire as he drove down a freeway with a friend until a passing motorcyclist informed him. Jackson noted: \"The kid probably saved our lives.\"\r\n\r\nJackson faced numerous disagreements with the song's co-producer. It has been reported that Quincy Jones did not want the song to appear on Thriller and that he felt that the song was too weak to be part of the collection, but Jones has stated this is a false rumor. The producer disliked the demo and did not care for the song's bassline. Jones wanted to cut Jackson's 29-second introduction, which was the longest one ever created at the time. The entertainer, however, insisted that it be kept. \"I said, 'Michael we've got to cut that intro'\" Jones later recalled. \"He said: 'But that's the jelly!''That's what makes me want to dance'. And when Michael Jackson tells you, 'That's what makes me want to dance', well, the rest of us just have to shut up.\" Jones also wanted to change the track's title to \"Not My Lover\", as he believed that people would think the song referred to the tennis player Billie Jean King. Jackson refused to change the title and asked Jones to give him co-producing credits for the track, as he felt that the demo tape sounded exactly like the finished product. In addition, Jackson wanted extra royalties. Jones granted neither and the two fell out for several days.\r\n\r\nHaving resolved their differences, Jones had Jackson sing his vocal overdubs through a six-foot-long cardboard tube. Jackson's entire lead vocal was performed in one take; he had received vocal training every morning throughout the production of the song. Jazz saxophonist Tom Scott played the lyricon. Bass guitarist Louis Johnson was then brought in and he played his part on every guitar he owned, before Jackson finally settled for a Yamaha bass. Greg Phillinganes was also drafted in and he played the keyboard. He later said of the song, \"'Billie Jean' is hot on every level. It's (sic) hot rhythmically moving action got Michael excited. It's hot sonically, because the instrumentation is so minimal, you can really hear everything. It's hot melodically  lyrically  vocally. It affects you physically, emotionally, even spiritually.\"\r\n\r\nThe song was mixed by Bruce Swedien ninety-one times — unusual for Swedien, who usually mixed a song just once. Jones had told Swedien to create a drum sound that no one had ever heard before. The audio engineer was also told to add a different element: \"sonic personality\". \"What I ended up doing was building a drum platform and designing some special little things, like a bass drum cover and a flat piece of wood that goes between the snare and the hi-hat\" Swedien later wrote. \"The bottom line is that there aren't many pieces of music where you can hear the first three or four notes of the drums, and immediately tell what the piece of music is.\" He concluded, \"But I think that is the case with 'Billie Jean' — and that I attribute to sonic personality.\"\r\n\"Billie Jean\" blends elements of post-disco, rhythm and blues, funk, and dance-pop. The song opens with a standard drum beat along with a standard hi-hat, and it contains hardly any reverberation. After two bars, another standard open hi-hat enters. After two more bars, a repetitive bassline enters. Each time it passes through the tonic, the note is doubled by a distorted synth bass. This accompaniment is followed by a repetitive three-note synth, played staccato with a deep reverb. The defining chord progression is then established. Jackson's quiet vocals enter, accompanied by a finger-snap, which comes and goes during the verses, as the rhythm and chord progression repeats.\r\n\r\nAccording to Daryl Hall, when Jackson was recording “We Are the World,” Jackson approached him and admitted to lifting the bassline for \"Billie Jean\" from a Hall & Oates song (apparently referring to Hall's \"I Can't Go for That (No Can Do)\" from the 1981 album Private Eyes): \"Michael Jackson once said directly to me that he hoped I didn't mind that he copied that groove.\" Hall says he told Jackson that he had lifted the bassline himself, remarking, \"it's something we all do.\"\r\n\r\nAccording to Inside the Hits, the lyrics refer to the commotion created by Billie Jean on a dance floor. She entices the crowd with a seductive come-on before luring Jackson to her bedroom, through the fragrance of her perfume. Jackson's vocal range spanned from a high baritone to a falsetto and he usually wrote melodies to show this range. However, in the verses of \"Billie Jean\", the singer's vocals range from a tenor to a low falsetto. A four note falsetto is showcased in the chorus and, during the last line, Jackson peaks at a full octave. The song has a tempo of 117 beats per minute and is in the key of F-sharp minor. Following the first chorus, a cello-like synth eases in at the beginnings of both the third, and later, the fourth, verses. Upon the announcement that the baby's eyes resemble Jackson's, a voice laments, \"oh no\". This is met with Jackson's signature falsetto \"hee hee\". The bridge debuts the strings, and holds a pedal tone tonic with the exception of two lines and a chord leading into the chorus. Violins are then played, followed by a four-note minor guitar solo. During the solo, vocal shouts, screams and laughs are added. Throughout this, the chord progression remains unaltered and is laced with Jackson's vocal hiccups. All the musical and vocal elements are then brought together in the final chorus. In the fade, Jackson repeats the denial of fathering Billie Jean's child.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/michael_jackson_billie_jean.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=Zi_XLOBDo_Y"
  },
  {
    "strTrack": "The Rain (Supa Dupa Fly)",
    "strAlbum": "Supa Dupa Fly",
    "strArtist": "Missy Elliott",
    "strGenre": "Hip-Hop",
    "strDescription": "\"The Rain (Supa Dupa Fly)\" is the debut solo single by American rapper Missy \"Misdemeanor\" Elliott. It was written and composed by Don Bryant, Bernard \"Bernie\" Miller, Elliott, and producer Timbaland for her debut album Supa Dupa Fly (1997) and contains a sample of Ann Peebles' 1973 single \"I Can't Stand the Rain\", whose lyrics serve as the chorus.\r\n\r\nThe song was released to US radio stations on May 20, 1997, and the Hype Williams-directed video was released to video shows starting June 3, 1997. The song entered the Hot R&B Airplay chart in mid-June, and peaked at number 6 the week of August 9, 1997. It peaked at number 51 on the Hot 100 Airplay chart the following week.\r\n\r\nThe song was released as the album's lead single on July 2, 1997, and reached the top twenty in the United Kingdom and New Zealand. VH1 ranked the song 99th on VH1's 100 Greatest Songs of the '90s. And in 2010 Pitchfork Media included the song at number 33 on their Top 200 Tracks of the 90s. In 2000, \"The Rain (Supa Dupa Fly)\" was named the fourth-best single of 1999 by The Village Voice's annual-year end Pazz & Jop critics' poll.\r\n\r\nThe song's moans are used as a sample in Method Man & Redman's \"The ?\"",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/missy_elliott_the_rain_(supa_dupa_fly).jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=hHcyJPTTn9w"
  },
  {
    "strTrack": "She's So Lovely",
    "strAlbum": "Scouting for Girls",
    "strArtist": "Scouting for Girls",
    "strGenre": "Pop",
    "strDescription": "\"She's So Lovely\" is the debut single by English pop rock band Scouting for Girls. It was written by band frontman Roy Stride and produced by Andy Green and released on 27 August 2007 as the lead single from their self-titled debut studio album (2007).\r\n\r\nThe song peaked at number seven on the UK Singles Chart and also reached a peak of number six on the UK Download Chart. The song remained in the UK top 10 for six consecutive weeks.\r\n\r\nMusic video\r\nThe music video for \"She's So Lovely\" is set in a bowling alley. Roy Stride is trying to attract the attentions of a pretty girl (Louise Glover), but she has a boyfriend already. While the boyfriend is there, Roy tells the girl she looks beautiful. The boyfriend gets angry, but gets called away for his throw. As he scores a strike, Roy and the girl walk off down the hall together (although only their legs are shown, the shoes and jeans are the same as Roy's).",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/scouting_for_girls_shes_so_lovely.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=7ABNEjPxWEg"
  },
  {
    "strTrack": "Lullaby",
    "strAlbum": "I Could Live in Hope",
    "strArtist": "Low",
    "strGenre": "Indie",
    "strDescription": "Low is an American indie rock group from Duluth, Minnesota, formed in 1993. The group is composed of founding members Alan Sparhawk (guitar and vocals) and Mimi Parker (drums and vocals), joined by Steve Garrington (bass guitar). Previous bassists for the band include John Nichols from 1993 to 1994, Zak Sally from 1994 to 2005, and Matt Livingston from 2005 to 2008. The music of Low is characterized by slow tempos and minimalist arrangements. Early descriptions sometimes referred to it as a rock subgenre called \"slowcore\" often compared to the band Bedhead, who played this style during the early 1990s. However, Low's members ultimately disapproved of the term.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/low_lullaby.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=XaSVkb_XLt4"
  },
  {
    "strTrack": "Unskinny Bop",
    "strAlbum": "Flesh & Blood",
    "strArtist": "Poison",
    "strGenre": "Hard Rock",
    "strDescription": "\"Unskinny Bop\" is the title of a song by American glam metal band Poison, which was released as the first single from their 1990 Flesh & Blood album.\r\n\r\nThe song peaked at number 3 on the US Billboard Hot 100, number 5 on the Mainstream rock charts, number 15 in the UK and #7 on the Australian charts. This made it the band's second highest success, after \"Every Rose Has Its Thorn\". The music video for the song has Bret Michaels dancing with a couple of animated neon cowgirls next to him.\r\n\r\nThe meaning of \"Unskinny Bop\" has always been shrouded in obscurity. C.C. DeVille later confessed that the phrase \"unskinny bop\" has no particular meaning. He invented it as a temporary measure while writing the song, before vocalist Bret Michaels had begun working on the lyrics. The phrase was used on the basis that it was phonetically suited to the music. The song was later played to producer Fairbairn, who stated that, although he did not know what an \"unskinny bop\" was, the phrase was perfect.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/poison_unskinny_bop.jpg?alt=media",
    "strMusicVid": "https://www.dailymotion.com/video/x2r7ivh"
  },
  {
    "strTrack": "Take on Me",
    "strAlbum": "Hunting High and Low",
    "strArtist": "a-ha",
    "strGenre": "Synthpop",
    "strDescription": "\"Take on Me\" is a song by the Norwegian synthpop band A-ha. Written by the band members, the song was produced by Alan Tarney for the group's first studio album Hunting High and Low, released in 1985. The song combines synthpop with a varied instrumentation that includes acoustic guitars, keyboards, and drums.\r\n\r\nThe original \"Take on Me\" was recorded in 1984, and took three releases to chart in the United Kingdom, reaching number two on the UK Singles Chart in November 1985. In the United States, the song reached the top position of the Billboard Hot 100 in October 1985, due in no small part to the wide exposure of its memorable and cutting-edge music video on MTV, directed by Steve Barron. The video features the band in a pencil-sketch animation method called rotoscoping, combined with live action. The video won six awards, and was nominated for two others at the 1986 MTV Video Music Awards.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/a-ha_take_on_me.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=djV11Xbc914"
  },
  {
    "strTrack": "Lazeez",
    "strAlbum": "Against the Grain",
    "strArtist": "Acoustic Alchemy",
    "strGenre": "Jazz",
    "strDescription": "Against The Grain, Acoustic Alchemy's 8th album, was released October 11, 1994 under the GRP label. Despite having only ten tracks, Against the Grain manages to notch up a total play time of 53 minutes because of the band's experimentation with some longer, more drawn out tracks. The most successful effort from this release was \"Lazeez\", one of two tracks from this album to appear on the compilation album, \"The Very Best Of Acoustic Alchemy\" (2002).",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/acoustic_alchemy_lezeez.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=vgqqI-rMwus"
  },
  {
    "strTrack": "I Am the Black Wizards",
    "strAlbum": "In the Nightside Eclipse",
    "strArtist": "Emperor",
    "strGenre": "Black Metal",
    "strDescription": "In the Nightside Eclipse is the first studio album and fourth official release by Norwegian black metal band Emperor, released in 1994 through Candlelight Records. It was their only album to feature drummer Faust and one-time bassist Tchort. Considered a landmark in the black metal scene, the album has been ranked by critics as one of the most influential albums of the genre. It also contains some of Emperor's best known tracks, \"I Am the Black Wizards\" and \"Inno a Satana\".",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/emperor_i_am_the_black_wizards.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=YgQRRI9goFg"
  },
  {
    "strTrack": "England Belongs to Me",
    "strAlbum": "Shock Troops",
    "strArtist": "Cock Sparrer",
    "strGenre": "Punk Rock",
    "strDescription": "Cock Sparrer is an English punk rock band formed in 1972 in the East End of London. Although they have never enjoyed commercial success, they helped pave the way for early '80s punk scene and the Oi! subgenre. Their songs have been covered by many punk, Oi!, and hardcore punk bands. Their style is influenced by pub rock, glam rock and raw 1960s beat music as delivered by bands like the Small Faces and The Who. Their lyrics mostly deal with topics related to the daily lives of working class people. Their name derives from their original name, Cock Sparrow, a Cockney term of familiarity.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/cock_sparrer_england_belongs_to_me.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=BlSqt9EDGDg"
  },
  {
    "strTrack": "Happy",
    "strAlbum": "Girl",
    "strArtist": "Pharrell Williams",
    "strGenre": "Hip-Hop",
    "strDescription": "\"Happy\" is a song performed by American singer and producer Pharrell Williams, from the Despicable Me 2 soundtrack album. It also serves as the lead single from Williams' second studio album, G I R L. The song was written and produced by Williams. It was released on November 21, 2013 alongside a long-form music video presented via the website 24hoursofhappy.com. The song was reissued on December 16, 2013 by Back Lot Music, under exclusive license to Columbia Records, a division of Sony Music Entertainment.\r\n\"Happy\" has been highly successful, topping the US Billboard Hot 100 chart and charts in 23 other countries. It has sold one million copies in the United Kingdom, and has reached the summit on three separate occasions, both records in their own right.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/pharrel_williams_happy.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=y6Sxv-sUYtM"
  },
  {
    "strTrack": "Circle of Time",
    "strAlbum": "The Oracle",
    "strArtist": "Ring of Fire",
    "strGenre": "Metal",
    "strDescription": "Ring of Fire is an American neoclassical/progressive/power metal band from Chula Vista, California formed in 2000. Fronted by former Yngwie J. Malmsteen collaborator Mark Boals after the release of his solo album Ring of Fire, the band also included guitarist Tony MacAlpine, Planet X drummer Virgil Donati, grammy-award-winning bassist Philip Bynoe, and keyboardist Steve Weingart. Ring of Fire released three studio albums between 2001 and 2004, as well as a live album, Burning Live In Tokyo 2002. After disbanding, Boals, MacAlpine, and Donati later formed Seven the Hardway. Boals, MacAlpine, and keyboardist Vitalij Kuprij returned in 2014 with their fourth studio album Battle of Leningrad.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/ring_of_fire_circle_of_time.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=tjC1smn6D48"
  },
  {
    "strTrack": "How Long",
    "strAlbum": "Five-A-Side",
    "strArtist": "Ace",
    "strGenre": "Rock",
    "strDescription": "\"How Long\" is a 1975 song by the British group Ace from their album Five-A-Side. It reached No. 3 in the US and Canadian charts, and No. 20 in the UK Singles Chart. Although widely interpreted as being about adultery, the song was in fact composed by lead singer Paul Carrack upon discovering that bassist Terry Comer had been secretly working with the Sutherland Brothers and Quiver. The \"friends with their fancy persuasions\" cites in the lyrics, are said to be in reference to The Sutherland Brothers and Quiver's management. The guitar solo is by lead guitarist Phil Harris. Alan \"Bam\" King was the band's rhythm guitarist, formerly with the Action. Phil Collins later named the song as one of his top 10 favorites, describing it as a \"classic single\".",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/ace_how_long.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=75-jIZKhgg8"
  },
  {
    "strTrack": "Sorry",
    "strAlbum": "Purpose",
    "strArtist": "Justin Bieber",
    "strGenre": "Pop",
    "strDescription": "\"Sorry\" is a song recorded by Canadian singer Justin Bieber for his fourth studio album, Purpose (2015). Written by Bieber, Julia Michaels, Justin Tranter, Skrillex, and BloodPop; the song was produced by the latter two. It was released on October 22, 2015, as the second single from the album. A dancehall-pop, tropical house and moombahton song, \"Sorry\" contains in its instrumentation \"brassy horn bleats\", warm island rhythms and a dembow riddim beat. Lyrically, \"Sorry\" is a plea for a chance to apologize to a lover, with Bieber asking forgiveness and a second chance to redeem himself. Bieber has since said that the lover was Selena Gomez. \r\n\r\nCommercially, the song topped the charts of thirteen countries. It spent 7 weeks at number one on the Canadian Hot 100 and 3 weeks at number one on the US Billboard Hot 100; \"Sorry\" was replaced by third single \"Love Yourself\" on the chart dated February 13, 2016, making Bieber the 12th act in the Hot 100's history to succeed himself at number one. He also accomplished the same feat in the United Kingdom, becoming the third act ever to self-replace at the top of the UK Singles Chart. Globally, the song became one of the best selling digital music releases with over 10 million in sales in 2016 alone.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/justin_bieber_sorry.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=fRh_vgS2dFE"
  },
  {
    "strTrack": "Lullaby",
    "strAlbum": "Present : YOU",
    "strArtist": "GOT7",
    "strGenre": "K-Pop",
    "strDescription": "Present: You (stylized as Present: YOU) is the third Korean studio album by the South Korean boy band Got7. It was released on September 17, 2018 under the label of JYP Entertainment. It features the single \"Lullaby\" in four different languages (Korean, English, Chinese and Spanish) as well as solo tracks co-produced by each member. The album was certified platinum by Gaon Chart on November 8, 2018, after selling over 250,000 copies. On December 3, 2018, it was reissued as a repackage album titled Present: You & Me.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/GOT7_lullaby.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=9RUeTYiJCyA"
  },
  {
    "strTrack": "Boomerang",
    "strAlbum": "Boomerang",
    "strArtist": "JoJo Siwa",
    "strGenre": "Pop",
    "strDescription": "\"Boomerang\" is the debut single by American dancer, singer, actress, and YouTube personality JoJo Siwa. \"Boomerang\" was written by Griffith Frank, Heather Miley, Jordan Richman, and Siwa. Jordan Richman produced the record with Heather Miley as co-producer. The song was released as a digital single on May 6, 2016.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/jojo_siwa_boomerang.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=ypPSrRYOAj4"
  },
  {
    "strTrack": "Da zero a cento",
    "strAlbum": "Icona",
    "strArtist": "Baby K",
    "strGenre": "Rap",
    "strDescription": "\"Da zero a cento\" (From zero to one hundred) is a single of Italian singer Baby K, published June 22, 2018 as the third single from the third studio album.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/baby_k_da_zero_a_cento.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=XzuV0_cot-g"
  },
  {
    "strTrack": "Faded",
    "strAlbum": "Different World",
    "strArtist": "Alan Walker",
    "strGenre": "Electro House",
    "strDescription": "\"Faded\" is a hit song by Norwegian record producer and DJ Alan Walker. Incorporating vocals provided by Norwegian singer Iselin Solheim, the single was originally set to be released on 25 November 2015, but was delayed to 3 December 2015. The song was highly successful, peaking in the top 10 in most of the countries it charted in, and reached the top spot in more than 10 countries. It is currently the 19th most viewed video on YouTube, with over 2.6 billion views, 18 million likes and 500 thousand dislikes as of February 24, 2020 as well as being the 29th most streamed song on Spotify, with over 1 billion streams as of February 2020.\r\n\r\nWalker debuted a live performance of \"Faded\" with Solheim and string support on 27 February 2016 at X Games Oslo 2016. The performance was aired live on Norwegian television.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/alan_walker_faded.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=60ItHLz5WEA"
  },
  {
    "strTrack": "Money City Maniacs",
    "strAlbum": "Navy Blues",
    "strArtist": "Sloan",
    "strGenre": "Alternative Rock",
    "strDescription": "\"Money City Maniacs\" is a song by Canadian rock band Sloan, released as the first single from their 1998 album, Navy Blues. In a 2000 poll conducted by the music magazine Chart, the song was voted the 12th greatest Canadian song of all time. Between 1995 and 2016, \"Money City Maniacs\" was the eighth most played song by a Canadian artist on rock radio stations in Canada.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/sloan_money_city_maniacs.jpg?alt=media",
    "strMusicVid": "https://www.dailymotion.com/video/x2rc21w"
  },
  {
    "strTrack": "The Good in Everyone",
    "strAlbum": "One Chord to Another",
    "strArtist": "Sloan",
    "strGenre": "Alternative Rock",
    "strDescription": "\"The Good in Everyone\" is a song by Canadian rock band, Sloan. It was released as the lead single from the band's third studio album, One Chord to Another. The song peaked at #9 on Canada's Singles Chart, and continues to be one of the band's most popular songs. The song is featured on the first edition of MuchMusic's Big Shiny Tunes compilation series. The song was also the theme for the CBC television program George Stroumboulopoulos Tonight.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/sloan_the_good_in_everyone.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=Qffy6uHkcTU"
  },
  {
    "strTrack": "Spybreak!",
    "strAlbum": "Decksandrumsandrockandroll",
    "strArtist": "Propellerheads",
    "strGenre": "Trip Hop",
    "strDescription": "\"Spybreak!\" is a 1997 single by the big beat group Propellerheads from their first album, Decksandrumsandrockandroll. There are two versions of this song, called \"Spybreak! (Long One)\" and \"Spybreak! (Short One)\". The former is approximately three minutes longer than the latter. It appears in \"The Matrix\" during the lobby shootout sequence. The version used officially in the movie is titled \"Short One\". The track's inclusion in the film gave Propellerheads a boost into international recognition. \"Spybreak!\" was also included in The Simpsons episode \"Lisa the Tree Hugger\" and was played while Bart, wearing ninja clothes, posts a Thai restaurant's menus throughout Springfield, as well as during the end credits.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/propellerheads_spybreak!.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=xIXCVZ9evuo"
  },
  {
    "strTrack": "It's Over Now",
    "strAlbum": "Identify Yourself",
    "strArtist": "Neve",
    "strGenre": "Pop",
    "strDescription": "Neve was a pop rock band based out of Los Angeles, California. The band released two albums on Columbia Records, and scored one hit single in 1999, \"It's Over Now.\"",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/neve_it's_over_now.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=JzUuh1v6XxY"
  },
  {
    "strTrack": "Let Me Love You",
    "strAlbum": "Turning Point",
    "strArtist": "Mario",
    "strGenre": "R&B",
    "strDescription": "\"Let Me Love You\" is a song by American singer Mario. It was released in 2004 from his second studio album, Turning Point (2004). It was written by Ne-Yo, Kameron Houff and Scott Storch, and produced by Storch. The remix of the song, also produced by Storch, contains rapped verses from Jadakiss and T.I.. The song was an instant hit, garnering Mario a Grammy Award nomination for Best Male R&B Vocal Performance in 2006. In 2008, it was ranked at number 45 on Billboard's All-Time Top 100 Hot 100 singles during the first 50 years of the chart. It was the eighth most successful single of the decade according to the Billboard Hot 100 Songs of the Decade chart released in December 2009. In 2013, it was ranked at number 53 on Billboard's All-Time Top 100 Hot 100 singles during the first 55 years of the chart.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/mario_let_me_love_you.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=D6vCMxmkMKI"
  },
  {
    "strTrack": "Call Me Maybe",
    "strAlbum": "Kiss",
    "strArtist": "Carly Rae Jepsen",
    "strGenre": "Pop",
    "strDescription": "\"Call Me Maybe\" is a song recorded by Canadian singer-songwriter Carly Rae Jepsen for her EP Curiosity (2012) and appearing on her international debut album, Kiss. The song was written by Jepsen and Tavish Crowe as a folk song, but its genre was modified to pop following the production by Josh Ramsay. It was released as the lead single from the EP on 20 September 2011, through 604 Records. Jepsen was signed to Schoolboy Records, releasing her single in the United States through the label, as the first single from Kiss. Musically, \"Call Me Maybe\" is an upbeat teen pop track that draws influences from dance-pop and disco. Lyrically, the track alludes to the inconvenience that a love at first sight brings to a girl who hopes for a call back from a crush.\r\n\r\nThe song received generally positive reviews from contemporary critics, who praised its composition and clever lyrical content. \"Call Me Maybe\" has attained commercial success worldwide, reaching number one in Australia, Czech Republic, Denmark, Finland, France, Hungary, Ireland, Luxembourg, New Zealand, Poland, Slovakia, Switzerland, the United Kingdom and the United States, while peaking inside the top three in Austria, Belgium (Flanders & Wallonia), Germany, Israel, Japan, Netherlands, Norway, and Sweden. After reaching the top position in Canada, Jepsen became only the fifth Canadian artist to do so in her home country since 2007. In the United States, the track reached number one on the Billboard Hot 100 and the Pop Songs chart. The song is the first number one by a Canadian female artist on the Billboard Hot 100 chart since 2007's \"Girlfriend\" by Avril Lavigne. With worldwide sales of over 10 million copies, \"Call Me Maybe\" is one of the best-selling digital singles of all time.\r\n\r\nAn accompanying music video was directed by Ben Knechtel. In it, Jepsen seeks the attention of an attractive boy next door who is revealed at the close of the story to be attracted to a male band member. As part of promotion for the song, the singer has performed the track on The Ellen DeGeneres Show, where she made her US television debut, and at the 2012 Billboard Music Awards. \"Call Me Maybe\" has been covered by several artists, including Katy Perry, Kelly Clarkson, Dan Deacon, Fun, Big Time Rush, The Chipettes, R5, Lil' Wayne, Enter Shikari, Ben Howard, Nickelback, Cody Simpson, The Saturdays, Glee and parodied by Cookie Monster and some of the news staff of National Public Radio. It was also covered on the season premiere episode, \"The New Rachel\", of the fourth season of Glee. The song used in in other television shows, Castle, Jane by Design, Degrassi: The Next Generation, and 90210.\r\n\r\n\"Call Me Maybe\" was nominated for two Grammy Awards, for Song of the Year and Best Pop Solo Performance at the 55th Annual ceremony, which will be held on 10 February 2013. On 11 December 2012, \"Call Me Maybe\" was named Song of the Year of 2012 by MTV. In its 2012 Year-End issue, Billboard Magazine ranked this song #2 in the Hot 100 Songs, Digital Songs, and Canadian Hot 100 Songs charts, in each case behind \"Somebody That I Used to Know\", by Gotye featuring Kimbra. The song was also ranked number one by the Village Voice's annual Pazz and Jop poll, which compiles the votes of music critics from all over the United States. The song was the best-selling single worldwide in 2012, selling 10 million copies in that year alone, and best-selling single in iTunes Store in 2012.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/carly_rae_jepsen_call_me_maybe.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=fWNaR-rxAic"
  },
  {
    "strTrack": "Elvis Ain't Dead",
    "strAlbum": "Scouting for Girls",
    "strArtist": "Scouting for Girls",
    "strGenre": "Pop",
    "strDescription": "\"Elvis Ain't Dead\" is a song by the British band Scouting for Girls. It was released as a single on 17 December 2007.\r\n\r\nMusic video\r\nThe music video for \"Elvis Ain't Dead\" was recorded in a studio and involved the band members simply playing the song. There are shots of Roy Stride wandering around town and seeing people with Elvis haircuts and wearing the sorts of clothes he wore. At the end of the video he sees the girl that he is attracted to and the song fades with the words \"Elvis has left the building. Thank you and goodnight!\", a line made famous by Elvis.\r\n\r\nChart performance\r\nOn 16 December 2007, \"Elvis Ain't Dead\" debuted in the UK Top 40 at #33 in the UK Singles Chart via download sales alone. From then on, it slowly crept up the charts. It rose five places to #28 in its first week of physical release, then two places up to #26 the next week, climbed a further nine places to #17 in its third week and it then jumped another seven places to #10 in its fourth week, hence becoming the band's second UK Top 10 single. It rose two more places to its peak at #8 in its fifth week where it stayed in its sixth week.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/scouting_for_girls_elvis_ain't_dead.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=3jpLo1A4x_g"
  },
  {
    "strTrack": "Naïve",
    "strAlbum": "Inside In/Inside Out",
    "strArtist": "The Kooks",
    "strGenre": "Indie",
    "strDescription": "\"Naïve\" is a song by British indie rock band The Kooks. It was released on 27 March 2006 as the fourth single from their debut studio album, Inside In/Inside Out (2006). \"Naïve\" charted at number five on the UK Singles Chart. The best-selling single of the band's career, it was the UK's nineteenth best selling single of 2006. It also did relatively well in New Zealand, reaching number 15 on the combined sales/airplay RIANZ chart. The song additionally charted in the United States, peaking at number 21 on the Billboard Alternative Songs chart.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/the_kooks_naive.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=jkaMiaRLgvY"
  },
  {
    "strTrack": "Smack My Bitch Up",
    "strAlbum": "The Fat of the Land",
    "strArtist": "The Prodigy",
    "strGenre": "Big Beat",
    "strDescription": "\"Smack My Bitch Up\" is a song by British big beat group the Prodigy. It was released in November 1997 as the third and final single from the album The Fat of the Land. The song was voted by Mixmag readers as the third greatest dance record of all time. Although the song wasn't as big a commercial success as their previous singles, it gained a cult following.\r\n\r\nThe song caused considerable controversy because of its allegedly misogynistic title and its video, which depicted scenes of drunken and drug-fuelled sexual excess and violence.\r\n\r\nPrior to the release of the single, Liam Howlett was presented with three remixes of the title song, one by Jonny L, one by DJ Hype and one by Slacker. Howlett chose the DJ Hype remix to be released on the single. The Jonny L remix was released through a free CD that came along with the January issue of Muzik magazine in 1998, while the Slacker remix was never officially released, although it surfaced on a rare and limited set of white labels.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/the_prodigy_smack_my_bitch_up.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=BJHVX_rKBHI"
  },
  {
    "strTrack": "Bring Me to Life",
    "strAlbum": "Fallen",
    "strArtist": "Evanescence",
    "strGenre": "Rock",
    "strDescription": "\"Bring Me to Life\" is a song by American rock band Evanescence. It was written by Amy Lee, Ben Moody and David Hodges and produced by Dave Fortman. It also features guest vocals from Paul McCoy of the band 12 Stones. Wind-up released \"Bring Me to Life\" in 2003 as the lead single from Evanescence's debut studio album, Fallen. The song delivers genres from alternative metal to rap rock and gothic metal among others.\r\n\r\nAccording to Lee, \"Bring Me to Life\" has several meanings and inspirations; its subjects are an incident in a restaurant, open-mindedness, and waking up to the things which are missing in the protagonist's life. Lee later revealed that the song was inspired by her long-time friend and husband Josh Hartzler. Critical response to the song was mostly positive, critics praising the melody of the song, Lee's vocals and their accompaniment by McCoy.\r\n\r\nFollowing the inclusion of \"Bring Me to Life\" on the Daredevil soundtrack, it has become a commercial and critical success topping the charts in Australia, the United Kingdom and Italy. It charted in the top ten in more than fifteen countries including the United States, Argentina, Germany and New Zealand. \"Bring Me to Life\" was certified Platinum by the Recording Industry Association of America (RIAA) and twice Platinum by the Australian Recording Industry Association (ARIA). The lyrics of the song have been interpreted as a call for new life in Jesus Christ, which helped the song to chart on the Christian rock charts.\r\n\r\nThe band won in the category for Best Hard Rock Performance at the 46th Grammy Awards where the song was also nominated for Best Rock Song. The accompanying music video was directed by Philipp Stölzl; it shows Lee singing and climbing on a skyscraper while having nightmares in her bedroom. \"Bring Me to Life\" was part of the set list during the Fallen and The Open Door Tour. Many artists recorded cover versions of the song, including the classical singer Katherine Jenkins and American pianist, John Tesh. The song was also used on several television shows.\r\n\r\nThe accompanying music video for \"Bring Me to Life\" was directed by Philipp Stölzl. After the success of the video, Lee received some film offers. Talking about the video, Stölzl said: \"On the one hand, it brings out the most catchy part of the song, the bridge, the duet with the male and female vocals. On the other hand, it reflects the  soundtrack background of the song. I did not know if I would have to use a stunt double for most of the angles, which would have restricted me a lot, but then it turned out that Amy did everything herself, hanging on Paul's arm for hours without getting tired. In the end, she is the one who made that shot strong.\"\r\n\r\nThe video begins with Amy Lee dressed in a grey nightgown, barefoot and asleep in a bed within a building, dreaming of falling through the air below a skyscraper. As the chorus begins, the band and Paul McCoy are performing in another room as Lee awakens and makes her way to the window. Lee exits the room out of the window and proceeds to climb up the side of the building with the wind blowing her hair and nightgown until she reaches the window of the room where the band is performing. During the bridge, McCoy notices Lee and opens the window, which causes her to lose her balance, and she grabs the ledge she was previously standing on. Throughout the bridge and final chorus, McCoy unsuccessfully attempts to pull Lee up, and she falls from his grasp down the building. However, she is then shown asleep in her bed again.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/evanescence_bring_me_to_life.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=3YxaaGgTQYM"
  },
  {
    "strTrack": "Smooth Criminal",
    "strAlbum": "Bad",
    "strArtist": "Michael Jackson",
    "strGenre": "Pop",
    "strDescription": "\"Smooth Criminal\" is the seventh single from Michael Jackson's 1987 Bad album. The song contains a fast-paced beat intertwined with Jackson's lyrics about a woman named Annie, who has been attacked in her apartment by a \"smooth\" assailant. It was released as a single on October 21, 1988, and peaked at number seven on the Billboard Hot 100. It was re-released on April 10, 2006, as a part of the Visionary: The Video Singles box-set. The re-released Visionary single charted at number 19 in the UK. The piece is one of Jackson's signature songs, and has appeared on numerous greatest hits albums, including Number Ones, The Essential Michael Jackson, Michael Jackson: The Ultimate Collection, King of Pop, This Is It, and Immortal (for the New version of song).\r\n\r\nThe song also serves as the theme song to Jackson's 1988 film Moonwalker. The single has sold over 7.5 million copies.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/michael_jackson_smooth_criminal.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=h_D3VFfhvs4"
  },
  {
    "strTrack": "Ace of Spades",
    "strAlbum": "Ace of Spades",
    "strArtist": "Motörhead",
    "strGenre": "Speed Metal",
    "strDescription": "Initially issued as a 7\" vinyl single on 27 October 1980 as a preview to the album Ace of Spades and autumn tour, Bronze Records also released a 12\" vinyl pressing in special Christmas picture sleeves, limited to 50,000 copies. The picture of the band in Santa outfits used on the cover was taken at the Aylesbury Fair, while the band were on tour.\r\nBronze also issued German and Spanish 7\" vinyl versions which had a different sleeves, as well as a Japanese release, with a colour picture insert with song lyrics in English and Japanese. One sided test pressings (not mis-presses, but used in the trade) escaped the pressing plant and are on the market.\r\nThe song opens with an overdriven bass solo played by Lemmy. For the lyrics, he said he \"used gambling metaphors, mostly cards and dice – when it comes to that sort of thing, I'm more into the one-arm bandits actually, but you can't really sing about spinning fruit, and the wheels coming down\".\r\nOn 6 September 1980 Lemmy was interviewed by Graham Neale on BBC Radio 1's Rock On Saturday show, \"Bomber\", \"Ace of Spades\" and \"Love Me Like a Reptile\" were played. The following month, on 6 and 20 October, the band played the song on BBC TV show Top of the Pops.\r\nIn the studio version, the last lines of the bridge are \"I don't want to live forever/And don't forget the Joker\". In the live versions and the Rock Band 2 remake, the last lines are \"I don't want to live forever/But, apparently I am\".",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/mot%C3%B6rhead_ace_of_spades.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=yxJwP0izGgc"
  },
  {
    "strTrack": "Party Rock Anthem",
    "strAlbum": "Sorry for Party Rocking",
    "strArtist": "LMFAO",
    "strGenre": "Pop",
    "strDescription": "\"Party Rock Anthem\" is a song performed by American electro recording duo LMFAO, featuring British singer Lauren Bennett and GoonRock. It was released as the first single from their second album Sorry for Party Rocking in 2011. It interpolates lyrics from Rick Ross' song \"Hustlin\". The single has gone to number one in Australia, Belgium, Brazil, Canada, Denmark, France, Germany, Ireland, New Zealand, Switzerland, the United Kingdom and the United States. It also reached the top five in Norway and Italy. Certified 11x Platinum, it is the second biggest-selling single of all time in Australia, behind only Elton John's \"Candle in the Wind 1997\".\r\n\r\nThe song spent eleven weeks at number one in New Zealand and ten weeks in Australia. It is the longest-running number one single in New Zealand since Smashproof's hit single \"Brother\" in 2009, selling over 45,000 copies there, whereas in Australia, it is the longest-running number-one single since \"I Wish I Was a Punk Rocker (With Flowers in My Hair)\" by Sandi Thom in 2006 and the best-selling single of 2011.\r\n\r\n\"Party Rock Anthem\" is a mostly electronic composition. It topped the 7 million downloads mark in the United States in July 2012, becoming the second fastest song in digital history to reach this plateau (in 68 weeks) just behind Adele's \"Rolling in the Deep\" which achieved it in 67 weeks, and the third-biggest selling digital single since Nielsen SoundScan began tracking digital sales in 2003. It reached number one on the Billboard Hot 100 and remained there for six straight weeks. The song spent 68 weeks on the chart, becoming the third most total weeks on Billboard Hot 100 history. It has also sold 7,463,000 copies in the US as of January 2013, and over one million copies in the UK. Worldwide, it was the third best-selling digital single of 2011 with sales of 9.7 million copies. The song won for Favorite Song at the 2012 Kids' Choice Awards. Being featured in the 2012 film 21 Jump Street, it won the MTV Movie Award for Best Music.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/LMFAO_party_rock_anthem.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=KQ6zr6kCPj8"
  },
  {
    "strTrack": "You on My Mind",
    "strAlbum": "Private View",
    "strArtist": "Swing Out Sister",
    "strGenre": "Pop",
    "strDescription": "\"You on My Mind\" is a song by the British pop group Swing Out Sister. It was the lead-off single from the group's second album, Kaleidoscope World. It featured a more sophisticated blend of musical components. The extended version begins with the quote \"Why don't you just relax and have your orange juice and shut up, Delgetti?\" by Steve McQueen, which was featured in the film Bullitt.\r\n\r\nMusic video\r\nThe music video was strongly inspired by the 1968 cult film, The Thomas Crown Affair.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/swing_out_sister_you_on_my_mind.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=CU9pEi3ByTw"
  },
  {
    "strTrack": "Bitter Sweet Symphony",
    "strAlbum": "Urban Hymns",
    "strArtist": "The Verve",
    "strGenre": "Alternative Rock",
    "strDescription": "The music video is an homage to the single continuous shot docu-fiction music video for Massive Attack's \"Unfinished Sympathy\" and focuses on Ashcroft singing while walking down a busy London pavement, refusing to change his stride or direction throughout (oblivious to what is going on around him), except for one instance where he is forced to stop for a moving car and a reflection is seen of him standing stationary in the car's tinted window. He narrowly avoids being hit by a car as he starts his walk, passers-by then repeatedly bump into him (causing one young woman to lose balance and fall), and he also jumps on top of the bonnet of another vehicle stopped in his path (the driver gets out of her car and proceeds to confront him, while he continues unflinchingly). At the end of the video, the rest of The Verve join Ashcroft, and the final shot sees them walking down the street into the distance.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/the_verve_bitter_sweet_symphony.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=1lyu1KKwC74"
  },
  {
    "strTrack": "Radioactive",
    "strAlbum": "Night Visions",
    "strArtist": "Imagine Dragons",
    "strGenre": "Indie",
    "strDescription": "\"Radioactive\" is a song recorded by American indie rock band Imagine Dragons for their major-label debut EP Continued Silence and later on their debut studio album, Night Visions, as the opening track. \"Radioactive\" was first sent to radio on April 2, 2012[ and again on October 29, 2012.\r\nMusically, 'Radioactive' is an indie rock song with elements of electronic rock and dubstep while containing cryptic lyrics of apocalypse and revolutionist themes. The song received critical acclaim from critics who praised the production, lyrics and the vocals. Due to heavy rotation on commercials and movie trailers, the song has so far reached #17 on the Billboard Hot 100 chart, becoming their second Top 20 single. It also reached #1 on the Billboard Alternative songs.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/imagine_dragons_radioactive.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=ktvTqknDobU"
  },
  {
    "strTrack": "Fix You",
    "strAlbum": "X&Y",
    "strArtist": "Coldplay",
    "strGenre": "Pop-Rock",
    "strDescription": "\"Fix You\" is a song by British alternative rock band Coldplay. It was written by all four members of the band for their third album, X&Y. The track is built around an organ, that is accompanied by slow tempo drums, and a vocals. It was released on 5 September 2005 as the second single from X&Y and has reached number four in the United Kingdom Singles Chart. The song reached number 18 in the United States Billboard Hot Modern Rock Tracks. Promo singles were released for the UK and US.\r\nBlythe Danner, the mother of Gwyneth Paltrow and Chris Martin's mother-in-law, stated in an interview in May 2012 that Chris Martin 'wrote the song Fix You for Gwyneth when her father died and I weep every time I hear it'.\r\n\"Fix You\" received positive reviews. It has been widely sampled, with different covers and sounds. The song, itself, was nominated for multiple awards in the categories of Best Song Musically and Lyrically and Anthem of the Summer. The music video was garnered as a tribute to the 7 July 2005 London bombings.\r\nThe guitar solo of \"Fix You\" is currently used as the player introduction at all of the National Hockey League's Montreal Canadiens' home games.\r\nThe song was played live to a motionless crowd at the Steve Jobs memorial/celebration-of-life event at Apple headquarters on 19 October 2011 in Cupertino, CA.\r\n\"Fix You\" covered by Boyce Avenue was used in the video \"Internet Love Story: CTFxC Wedding (Charles & Alli)\" uploaded by user charlestrippy on 22 November 2011. As of 27 April 2012 it currently has 2,330,161 views.\r\n\r\nThe music video for \"Fix You\" was directed by Sophie Muller, who had previously worked with the band for their 2002 video \"In My Place\". The video was filmed at the end of two concerts on 4 and 5 July 2005 at the Reebok Stadium in Bolton, England, which were the band's first ever stadium performances. The concert goers doubled as extras for the video shoot, which required two takes on each day to complete. In the first half of the video, Martin, wanders the streets of London starting at Tooley Street under London Bridge station, while the slogan \"Make Trade Fair\" is projected onto the Royal National Theatre, using the same Baudot code colour scheme on the cover of X&Y. The tunnels that Martin is seen wandering within are located both in and around King's Cross and St Pancras railway stations, with the filming for the video taking place during the time of the redevelopment and expansion of the latter. Martin is then seen walking across Waterloo Bridge, which crosses the River Thames, connecting the South Bank with The Strand. As soon as the electric guitar kicks in, Martin's walk turns into a run as he darts through streets of London, until very quickly reaching the side of the stage at the Reebok Stadium in Bolton, where he joins the rest of the band for the song's finale. The audience sings along with the song's final refrain, and at the end of the video Martin thanks them for their support and wishes them goodnight.\r\n\r\nThe video debuted on 1 August 2005. It was nominated at the 15th annual Music Video Production Association Awards in the category of Adult Contemporary. After its release, the music video was repurposed as a tribute to the victims of the 7 July 2005 London bombings, although it was filmed before they occurred.",
    "strTrackThumb": "https://firebasestorage.googleapis.com/v0/b/rwa-projekt-api.appspot.com/o/coldplay_fix_you.jpg?alt=media",
    "strMusicVid": "https://www.youtube.com/watch?v=k4V3Mo61fJM"
  }
]